var data= {
  welcome1: {
    title: "ช่องทางการติดต่อ",
    text: "ช่องทาง facebook https://www.facebook.com/maxtrarich\n\
    ช่องทาง LINE https://lin.ee/3XCC1nT",
    image: ["images/contact.jpg"]
  },
  welcome2: {
    title: "ขอข้อมูลลูกค้า",
    text: "แอดมินรบกวนขอทราบชื่อ เบอร์โทรศัพท์ และเวลาที่สะดวกเพื่อให้เจ้าหน้าที่ติดต่อให้ข้อมูลเพิ่มเติมนะคะ",
    image: ["images/contact.jpg"]
  },
  welcome3: {
    title: "เปิดบัญชี",
    text: "เริ่มต้นการเทรดกับ MaxtraRich Forex สามารถคลิ๊กสมัครจากลิ้งก์  https://maxtrarich.com/ และดูวิธีการสมัครจากไฟล์คู่มือที่ส่งแนบมานี้ได้เลยค่ะ  https://drive.google.com/file/d/1bAYQ8oWp2P6LOunj0kyNd9aWnMbYOoI-/view ",
    image: ["images/contact.jpg"]
  },
  welcome4: {
    title: "ยืนยันตัวตน",
    text: "ลูกค้าสามารถลงชื่อเข้าใช้งานเพื่อยืนยันตัวตนตามขั้นตอนได้เลยนะคะ\n\
    วิธีการยืนยันตัวตน : https://drive.google.com/file/d/1-jHa6yNMkIDUU9Pmk7OVxT3AS6m-k3fJ/view?usp=sharing",
    image: ["images/contact.jpg"]
  },
  welcome5: {
    title: "เอกสารยืนยันตัวตน",
    text: "เอกสารที่ลูกค้าสามารถใช้ยืนยันที่อยู่ได้ ดังนี้ บิลค่าไฟ บิลค่าน้ำ บิลค่าโทรศัพท์ บิลค่าอินเตอร์เน็ต ใบกำกับภาษี รายการเดินบัญชีธนาคารที่มีระบุข้อมูล ชื่อและที่อยู่ของลูกค้าชัดเจน หรือสำเนาทะเบียนบ้าน ทั้งหน้าข้อมูลที่อยู่ และหน้าที่มีชื่อของลูกค้าก็ได้เช่นกันค่ะ หากติดตรงขั้นตอนไหนสอบถามมาทางแอดมินได้เลยนะคะ",
    image: ["images/contact.jpg"]
  },
  welcome6: {
    title: "ประเภทบัญชี",
    text: "1. Standard บัญชีมาตรฐาน พร้อมเงื่อนไขที่ดีที่สุด\n\
    - ฝากขั้นต่ำ 5 USD \n\
   - เลเวอเรจสูงสุดที่ 1:3000\n\
   - ไม่มีค่าคอมมิชชั่น\n\
   - ออกออเดอร์ต่ำสุดที่ 0.01 Lot Size\n\
2. VIP (Low Spread) สำหรับลูกค้าที่เทรดเยอะ ด้วยต้นทุนสเปรดที่ต่ำกว่าเดิม\n\
    - ฝากขั้นต่ำ 100 USD \n\
   - เลเวอเรจสูงสุดที่ 1:100\n\
   - ไม่มีค่าคอมมิชชั่น\n\
   - ออกออเดอร์ต่ำสุดที่ 0.01 Lot Size\n\
3. Free Swap สำหรับลูกค้าที่ถือออเดอร์ข้ามวัน\n\
    - ฝากขั้นต่ำ 5000 USD \n\
   - เลเวอเรจสูงสุดที่ 1:1000\n\
   - ออกออเดอร์ต่ำสุดที่ 0.01 Lot Size",
    image: ["images/contact.jpg"]
  },
  promotion1: {
    title: "โปรโมชั่นที่มี",
    text: "โปรโมชั่นของเราที่มีตอนนี้คือ\n\
    โปรโมชั่น เติมเงิน $50 รับเครดิตโบนัส $100\n\
    โปรโมชั่น เติมเงิน รับเครดิตโบนัส 50%\n\
    โปรโมชั่นชวนเพื่อนฝากเงินรับเครดิตโบนัส $250\n\
    และโปรโมชั่นชวนเพื่อนฝากเงินรับเครดิตโบนัส 10% ค่ะ",
    image: ["images/contact.jpg"]
  },
  promotion2: {
    title: "ฝาก $50 รับเครดิตโบนัส $100",
    text: "Promotion $100 กับ Maxtra Rich Forex\n\
    * เปิดบัญชีและทำการฝากเงิน $50\n\
    * ระยะเวลาการใช้โบนัส 60 วัน นับตั้งแต่วันที่ได้รับโบนัส\n\
    * ไม่สารมารถทำการ Hedging/Square\n\
    Maximum Leverage 1:100\n\
    โบนัสจะถูกยกเลิกอัตโนมัติ ในกรณีที่ลูกค้าทำการถอนเงิน\n\
    สามารถถอนเงินได้ไม่มีเงื่อนไขจำกัด\n\
    เงินโบนัสเข้าสู่บัญชีท่านโดยอัตโนมัติ\n\
    หากยังไม่ได้รับ Bonus 100$ สามารถติดต่อเจ้าหน้าที่ได้ทุกช่องทาง\n\
    ข้อเสนอนี้จำกัด 1 บัญชี ต่อลูกค้า 1 คน ต่อ 1 IP Addressเท่านั้น\n\
    โบนัสจะถูกยกเลิกอัตโนมัติ ในกรณี Equity อยู่ในระดับที่โดน Stop out\n\
    Linkสมัคร : https://maxtrarich.com/",
    image: ["images/promotion1.jpg"]
  },
  promotion3: {
    title: "รับเครดิตโบนัส 50% สูงสุด $500",
    text: "ข้อมูลโบนัส 50%\n\
    เครดิตสูงสุดที่ให้ในข้อเสนอนี้คือ 500 USD\n\
    Leverage 1:500\n\
    ฝากเงินขั้น ต่ำเพียง $50\n\
    Maximum Bonus  $500\n\
    ไม่มีกำหนดระยะเวลาในการใช้โบนัส\n\
    ข้อเสนอนี้จำกัด 1 บัญชี ต่อลูกค้า 1 คน ต่อ 1 IP Addressเท่านั้นจะได้รับเครดิตโบนัสทุกครั้งเมื่อมีรายการฝาก\n\
    เครดิตโบนัสจะถูกยกเลิกตามสัดส่วนในการถอน\n\
    เครดิตโบนัสจะถูกยกเลิกในกรณี Equity อยู่ในระดับที่โดน Stop out",
    image: ["images/promotion2.jpg"]
  },
  promotion4: {
    title: "ชวนเพื่อน $1,000",
    text: "- เปิดบัญชีเพื่อฝากเงิน $1,000 รับเครดิตโบนัส $250 ต่อ 1 บัญชีเทรด\n\
    - สามารถถอนกำไรได้เมื่อเทรดครบ 50 Lots ภายในระยะเวลา 3 เดือน หากมีการถอนเงิน เครดิตจะถูกยกเลิกโดยอัตโนมัติ\n\
    - ห้ามการเทรด Hedging\n\
    - การถอนโดยผิดเงื่อนไขถือเป็นการกระทำผิดกติกา บัญชีเครดิตโบนัสจะถูกยกเลิก\n\
    - หากทำการเทรดครบตามข้อกำหนดแล้ว ต้องการดำเนินการถอนเงิน กรุณาติดต่อเจ้าหน้าที่เพื่อทำการตรวจสอบ",
    image: ["images/contact.jpg"]
  },
  promotion5: {
    title: "ชวนเพื่อน 10%",
    text: "- รับเครดิตโบนัส 10% สูงสุด $100 สำหรับการฝากครั้งแรก\n\
    - สามารถถอนกำไรได้เมื่อเทรดครบ 100 Transactions (Standard) และ 10 Lots (Standard)\n\
    - เครดิตโบนัสจะถูกยกเลิกอัตโนมัติ ในกรณี Equity อยู่ในระดับที่โดน Stop out และเมื่อมีการการถอนเงิน\n\
    - ห้ามการเทรด Hedging\n\
    - การถอนโดยผิดเงื่อนไขถือเป็นการกระทำผิดกติกา บัญชีเครดิตโบนัสจะถูกยกเลิก\n\
    - หากทำการเทรดครบตามข้อกำหนดแล้ว ต้องการดำเนินการถอนเงิน กรุณาติดต่อเจ้าหน้าที่เพื่อทำการตรวจสอบ",
    image: ["images/promotion5.jpg"]
  },
  service1: {
    title: "บริการที่มี",
    text: "คุณลูกค้าสนใจสอบถามบริการใดดีคะ \n\
    -ห้อง Signal \n\
    -คลาสเรียนเทรด \n\
    -ระบบเทรดอัตโนมัติ \n\
    -โปรโมชั่น",
    image: ["images/service1.jpg"]
  },
  service2: {
    title: "ห้องซิกแนล",
    text: "1.ห้อง VIP Signal\n\
    กลยุทธ์ : แนวรับแนวต้าน\n\
    ปริมาณความถี่ของสัญญาณต่อวัน : สูง\n\
    ความแม่นยำ : 70-85%\n\
    สัญญาณจากสินค้าประเภท : สกุลเงินและทองคำ\n\
    เงื่อนไขการฝากเงินขั้นต่ำเพื่อเข้าห้อง : 1000$\n\
    2.ห้อง Moo Moo Signal\n\
    กลยุทธ์: แนวรับแนวต้าน\n\
    ปริมาณความถี่ของสัญญาณต่อวัน: วันละ 1-2 ครั้ง\n\
    ความแม่นยำ: 65-80\n\
    สัญญาณจากสินค้าประเภท: สกุลเงินและทองคำ\n\
    เงื่อนไขการฝากเงินขั้นต่ำเพื่อเข้าห้อง: 100$",
    image: ["images/contact.jpg"]
  },
  service3: {
    title: "ea",
    text: "บริการเทรดอัตโนมัติ ฝากเงินขั้นต่ำ $300\n\
    กลยุทธ์ และการทำงานของ EA The Gold Pattern\n\
    The Gold Pattern เป็นระบบเทรดที่ใช้กลยุทธ์ทางเทคนิคอลอย่างแนวรับแนวต้าน บริเวณที่ราคาสินค้าหรือตลาด มีปริมาณการซื้อขายสูงขึ้นอย่างมีนัยยะสำคัญ โดยระบบจะหาจุดออกออเดอร์จากการเคลื่อนไหวของราคา และสถิติการกลับตัวหรือปฏิกิริยาของตลาดที่มีการตอบสนองต่อบริเวณราคาดังกล่าว ซึ่งผลจากการใช้กลยุทธ์ ควบคู่กับวิธีการจัดการเชิงปริมาณ จึงทำให้ The Gold Pattern สามารถสร้างผลตอบแทนแบบระยะยาว และมีการเติบโตอย่างแข็งแกร่ง \n\
รูปแบบการจัดการเงินทุน : Fixed Static\n\
    คือการใช้ข้อมูลสถิติการเทรดที่มีการทดสอบย้อนหลังในระยะเวลาที่กำหนด(โดยมาตรฐาน2ปี) โดยเริ่มจากการคำนวณการถือสภาวะขาดทุนสูงสุด เพื่อหาขนาดการซื้อขายที่เหมาะสมกับเงินทุน และทำให้พอร์ตการลงทุนมีภาวะขาดทุนต่ำสุดของระบบ และยังคงทำกำไรได้ โดยมีเป้าหมายการสร้างผลตอบแทนในระยะยาว \n\
เงินทุนเริ่มต้น:\n\
    300 USD\n\
Drawdown (DD)\n\
    ต่ำกว่า 10% \n\
Win rate 65%\n\
บริการที่ลูกค้าจะได้รับนอกเหนือจาก EA: \n\
    1. ลูกค้าจะได้รับบริการรัน EA ด้วย VPS ซึ่งดำเนินการโดยเทรดเดอร์ผู้มีประสบการณ์\n\
    2. บริการติดตั้ง และให้คำปรึกษา EA จากทีม MaxtraRich\n\
สถิติของ EA \n\
https://www.myfxbook.com/members/phatsin/phatsin-maxtrarich-goldv1/9434109 , \n\
https://www.mql5.com/en/signals/1198995 ,\n\
https://www.mql5.com/en/signals/1476424",
    image: ["images/service2.jpg"]
  },
  service4: {
    title: "ib",
    text: "การสนับสนุนการเป็น Partner จากเรา\n\
    - ค่าคอมสูงสุด 10$/Lot\n\
    - จัดสัมมนาให้\n\
    - Point แลกของรางวัล\n\
    - แจกโบนัส ตามยอดเทรดสูงสุด\n\
    - การวางแผนการตลาด\n\
    - ไม่จำกัดค่าคอมมิชชั่น ไม่มีค่าธรรมเนียมการเป็นสมาชิก\n\
    - Support Partner Team 24/7 \n\
    - Course เตรียมตัวสำหรับการเป็น Partner ฟรี!",
    image: ["images/contact.jpg"]
  },  
  activity1: {
    title: "เมษา พาสนุก",
    text: "📢📢 “ โปรสั้นๆรับหน้าร้อน!!! ”  รับโบนัสเพิ่มมากถึง 100$ (หนึ่งร้อยเหรียญ) !!!! 😲😲 เพียงแค่ทุกท่าน ฝากเงินเข้ามา 444$ ระยะเวลาแค่ 1 อาทิตย์เท่านั้น !!!\n\
    ก็รับไปเลยจุกๆ “100$ ” ในรูปแบบเครดิตได้ ง่ายๆ สั้นๆ สำหรับช่วงหน้าร้อนแบบนี้  \n\
  Promotion ดีดีแบบนี้ไม่มีที่ไหนแน่นอน อย่าปล่อยให้โอกาสหลุดลอยไป  \n\
  Maxtra Rich โบรกเกอร์ “ มืออาชีพ ” 🥰💖\n\
    พร้อมดูแล และ ให้คำแนะนำ ตลอด 24 ชม  “ ใครๆก็เทรดได้ มาร่วมเป็นส่วนหนึ่งกับเรา ”\n\
     เริ่มอาชีพนักลงทุน เปิดประสบการณ์ใหม่แห่งการลงทุนที่นี่ Website https://maxtrarich.com/\n\
  📫Inbox / comment สอบถามมาได้เลย!!!\n\
  📲 ID Line : @maxtrarich(มี@ด้วยนะครับ) \n\
  🧑💻 Website: https://maxtrarich.com/  \n\
  #Maxtrarich #forex #XAUUSD #Forex #Trading #Gold #GoldAnalysis #Dailyupdate #TechnicalAnalysis #Daytrade #Maxtrarich #Tradeforex #FxTrading #Gold #Investment",
    image: ["images/activity1-1.jpeg", "images/activity1-2.jpeg", "images/activity1-3.jpeg", "images/activity1-4.jpeg", "images/activity1-5.jpeg"]
  },
  other1: {
    title: "Hedging",
    text: "Hedging คือการที่ ในช่วงเวลาหนึ่งมีทั้งออเดอร์ Buy และ ออเดอร์ Sell ในสินค้าเดียวกันค่ะ",
    image: ["images/contact.jpg"]
  },
  other2: {
    title: "Spread",
    text: "",
    image: ["images/spread.jpg"]
  },
}
function menuToggle(id) {
  var x = document.getElementsByClassName("sub-menu");
  for(var i=0; i<x.length; i++){
      x[i].style.display="none";
      x[i].children[0].value="welcome1";
  }
  var xx = document.getElementById(id);
  xx.style.display="block";

  var y = document.getElementsByClassName("menuButton");
  for(var i=0; i<y.length; i++){
    y[i].style.background="";
  }
  var yy = document.getElementById(id+"-button");
  yy.style.background="green";

} 
function showContent(select) {
  if(data[select]===undefined){
    document.getElementById("text").innerText="ไม่มีข้อมูล";
    document.getElementById("image").src=data.contact.image;
    document.getElementById("textarea").value=document.getElementById("text").innerText;
  }else{
    document.getElementById("text").innerText=data[select].text;
    document.getElementById("image").src=data[select].image;
    document.getElementById("textarea").value=document.getElementById("text").innerText;
    const parent = document.getElementById("image")
    while (parent.firstChild) {
        parent.firstChild.remove()
    }
    for (let i=0; i<data[select].image.length; i++) {
      var img = document.createElement("img");
      img.src = data[select].image[i];
      var src = document.getElementById("image");
      src.appendChild(img);
    } 
  }
}
function copyText() {
  document.getElementById("textarea").value=document.getElementById("text").innerText;
  var copyText = document.getElementById("textarea");
  copyText.select();
  copyText.setSelectionRange(0, 99999);
  navigator.clipboard.writeText(copyText.value);
  document.getElementById("copyButton").innerText="คัดลอกข้อความแล้ว";
  delay(1500).then(() => {
    document.getElementById("copyButton").innerText="คัดลอกข้อความ";
  });
}
function copyImage() {
  try {
    navigator.clipboard.write([
        new ClipboardItem({
            'image/png': pngImageBlob
        })
    ]);
  } catch (e) {
      console.error(e);
  }
}
function delay(time) {
  return new Promise((resolve) => setTimeout(resolve, time));
}
